app/controllers/users_controller.rb

  def index

    #puts "l}#{request.ur"
    #puts "#{request.protocol}#{request.host_with_port}"

    @users = User.all
---
SELECT "users".* FROM "users"

  def oauth2callback

      @users = User.all
---
SELECT "users".* FROM "users"